module.exports = {
  config: {
    name: "Rahi",
    aliases: ["rahi", "mybots", "links"],
    permission: 0,
    prefix: true,
    description: "Send all my bot links and tutorials",
    categories: "Utility",
    usages: [".allbots"],
    credit: "Developed by Mohammad Nayan"
  },

  start: async ({ api, event }) => {
    const { threadId, message } = event;

    const myNumber = "8801711209381";
    const msg = `🌟 *RAHI BOT EDITER* 🌟

    ╰──────✧❁✧──────◆
╰════════════════


     1. ᵃ ᵇⁱᵗ ˢᵗᵘᵖⁱᵈ ᵗʸᵖᵉ!  ᴱᵛᵉⁿ ᵃᶠᵗᵉʳ ˢᵒ ᵐᵃⁿʸ ⁱⁿˢᵘˡᵗˢ, ᴵ ᶜᵒᵘˡᵈ ⁿᵒᵗ ᶠᵒʳᵍᵉᵗ ʰⁱᵐ...!🙂💔 আমি একটু বোকা টাইপের! এই যে এতো অপমানের পরেও তারে ভুলতে পারি নাই 🙂💔

      ╰──────✧❁✧──────◆
╰════════════════

2. ~Lovee?
~তুমি যেই রাস্তা দিয়ে হেঁটে যাও,
আমি ওই রাস্তার ধুলো কেও "ভালোবাসি"!😫🫵

- রাহি - 😉🙊
╰──────✧❁✧──────◆
╰════════════════

3. ツ🖤●── 🙂সুন্দর জায়গা সব সময় সুন্দর🙂✌️, buT a smiling face is more beautiful.ツ🖤●── 🙂

╰──────✧❁✧──────◆
╰════════════════

4. シ°
─༅༎༅💙🌼🩷༅༎༅─♥
🍒𝐈 𝐇𝐚𝐯𝐞 𝐀 𝐒𝐢𝐦𝐢𝐥𝐞𝐫 𝐂𝐚𝐩𝐭𝐢𝐨𝐧 𝐆𝐫𝐨𝐮𝐩 , 𝐈 𝐍𝐞𝐞𝐝 𝐒𝐨𝐦𝐞 𝐌𝐞𝐦𝐛𝐞𝐫𝐬,.. 𝐈𝐧𝐛𝐨𝐱 𝐌𝐞 𝐭𝐨 𝐉𝐨𝐢𝐧 𝐈𝐧 𝐆𝐫𝐨𝐮𝐩 .. •

⎯͢⎯⃝💙🪽🪄 

আমার একটি ছোট্ট মেসেনজার ক্যাপশন গ্রুপ আছে । আমার কিছু মেম্বার লাগবে , জয়েন হতে চাইলে ইনবক্স করুন । •⎯͢⎯⃝💙🪽☺️
༅༎༅💙🌼🩷༅༎༅─

╰──────✧❁✧──────◆
╰════════════════

5. 🔐🍒_____𝐈𝐭'𝐬 𝐧𝐨𝐭 𝐨𝐤𝐚𝐲 𝐭𝐨 𝐭𝐡𝐫𝐨𝐰 𝐬𝐨𝐦𝐞𝐭𝐡𝐢𝐧𝐠 𝐚𝐰𝐚𝐲____ 𝐁𝐞𝐜𝐚𝐮𝐬𝐞 𝐝𝐢𝐚𝐦𝐨𝐧𝐝𝐬 𝐚𝐫𝐞 𝐛𝐨𝐫𝐧 𝐟𝐫𝐨𝐦 𝐜𝐨𝐜𝐚𝐥__!!🌸🌼                        🔐🍒_____কোন কিছু খারাপ ভেবে ফেলে দেওয়া ঠিক নয়____ কারণ কয়লা থেকে কিন্তু হিরার জন্ম হয়__!!🌸🌼🙂🥀👈

╰──────✧❁✧──────◆
╰════════════════

6. মানুষ তার নিজের কর্মদোষে মন থেকে উটে যায়!  
এতে আমার আর করার কিছু  থাকে না...... 😎💔

╰──────✧❁✧──────◆
╰════════════════

7. ●══❥𝄞⋆⃝༎︵།།🖤🌻__♥︎__ সময়ের"সাথে"সাথে""নিজেকে 𝗨𝗽𝗱𝗮𝘁𝗲 করতে পারলেই "𝗟ⁱᶠᵉ "ɪs 𝕓𝕖𝕒𝕦𝕥𝕚𝕗𝕦𝕝__♥︎ ༎︵།།🖤🌻●══❥                       ♡︎____𝗶𝘁'𝘀 𝗠𝘆 not 𝗮𝘁𝘁𝗶𝘁𝘂𝗱𝗲 🫡🤗____♡︎ ♡︎___ __😎_♡︎

╰──────✧❁✧──────◆
╰════════════════

8. অর্থ আর স্বার্থ  এই দুটো জিনিস --
বদলে দেয় মানুষের চরিত্র..!! ☺️🦋

╰──────✧❁✧──────◆
╰════════════════

9. মুখের উপরে মানুষ আমাকে কত কিছু বলে অতচ আমি জবাব দিতে গেলে ভাবি থাক মানুষটা কষ্ট পাবে 😌😅❤️‍🩹

 ╰──────✧❁✧──────◆
╰════════════════

10. আগলে রাখার নাম যদি ভালোবাসা হয় তাইলে আমি আমার সবটুকু দিয়ে আগলে রাখবো..!🖤🥀
╰──────✧❁✧──────◆
╰════════════════

📞 *Contact Me*: +${myNumber}`;

    await api.sendMessage(threadId, { text: msg }, { quoted: message });
  }
};
